/*
 *  2012. 11.19
 *  
 * 	Testris - Shape
 * 			- 테트리스 도형을 위한 배열
 * 	
 */

package android.tetris;

import android.graphics.*;


public class Shape {
    static int[][][][] block = {	//Shape.block[모양][회전][벽돌][좌표]
    	{{{0,0},{0,1},{0,2},{1,2}}, {{0,1},{1,1},{2,1},{2,0}}, {{0,0},{1,0},{1,1},{1,2}}, {{0,1},{0,0},{1,0},{2,0}}}, // 역 기역
        {{{0,0},{1,0},{0,1},{0,2}}, {{0,0},{0,1},{1,1},{2,1}}, {{1,0},{1,1},{1,2},{0,2}}, {{0,0},{1,0},{2,0},{2,1}}}, // 기역
        {{{0,0},{1,0},{0,1},{1,1}}}, // 네모
        {{{0,0},{1,0},{1,1},{2,1}}, {{1,0},{1,1},{0,1},{0,2}}}, // z 모양
        {{{1,0},{2,0},{1,1},{0,1}}, {{0,0},{0,1},{1,1},{1,2}}}, // 역 z 모양
        {{{0,0},{0,1},{0,2},{0,3}}, {{0,0},{1,0},{2,0},{3,0}}}  // 일짜
   };
    
    //다음 레벨로 넘어가가 위한 점수
    static int[] level = {
    	0, 10, 20, 30, 60, 90, 120, 150, 180, 210, 300, 400, 500, 600, 700
    };
    
    //모양별 색깔
    static int[] color = {
    	Color.GREEN, Color.BLUE, Color.YELLOW, Color.RED, Color.MAGENTA, Color.GRAY, 
    	Color.WHITE, Color.BLACK
    };
}
